<h1><font color='lightblue'>Daten gruppieren (groupby-Funktion)</font></h1>

Für die Visualisierung ist eine Gruppierung der Daten hilfreich.


Hierfür kannst du die groupby() Funktion in Kombination mit der agg() Funktion verwenden.
                            

<h3><font color='lightblue'>groupby()</font></h3>


 1.      groupby()    -->   WELCHE Daten sollen gruppiert werden?
            
            
            
 2.      agg()       -->    WIE sollen die gruppierten Daten berechnet werden?
 
 
<h4><font color='lightblue'>Outside the box:</font></h4> 

 
 agg() oder aggregate()???
 
 Was soll ich verwenden?
 
 Es gibt die agg() und aggregate(). Beide Methoden sehen identisch aus. Welche solltest du also verwenden?
 
 In der Doku findest du eine Antwort :-)

In [1]:
# benötigte Bibliotheken importieren

import seaborn as sns 
import pandas as pd 
import numpy as np

In [5]:
# Beispieldatensatz

df_tips = sns.load_dataset('tips')
df_tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [6]:
#df_tips.size
df_tips.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

Um die Frage: wieviele Männer und Frauen besuchen unser Restaurant? zu beantworten, muss die spalte geschlecht zunächst nach Männern und Frauen gruppiert werden. danach kann die Anzahl ermittelt werden.

In [11]:
# Wie viele Frauen und Männer essen bei uns im Restaurant?

# groupby - erst gruppieren und danach eine Aggregationsfunktion aufrufen

#df_tips.groupby('sex', observed=False).size()  # Anzahl der Elemente
df_tips.groupby('day', observed=False).size()  # Anzahl der Elemente

day
Thur    62
Fri     19
Sat     87
Sun     76
dtype: int64

Wenn du mehrere Werte berechnen möchtest, gibst du im groupby deine spalte an die gruppiert werden soll. die zu berechnenden Werte gibst du in der Aggregationsfunktion an.

Frage: An welchen Tagen wird wie viel Trinkgeld im Schnitt gegeben und wie viel Leute kommen an den Tagen?

Vorüberlegung: 
              Zu Gruppieren ist nach den Tagen. Die Berechnung erfolgt für das Trinkgeld und die Tage

In [16]:
# An welchen Tagen wird wieviel Trinkgeld gegeben und wieviele Leute waren im restaurant?
#table_groupby = df.groupby(['A','B','C']).agg({'D':['sum', 'mean'],'E':['mean']})
df_tips.groupby('day', observed=False).agg({'tip': 'mean', 'size': ['sum','mean']})

           tip size
          mean  sum      mean
day
Thur  2.771452  152  2.451613
Fri   2.734737   40  2.105263
Sat   2.993103  219  2.517241
Sun   3.255132  216  2.842105

In [14]:
df_tips.groupby('day', observed=False).size()

day
Thur    62
Fri     19
Sat     87
Sun     76
dtype: int64

In [17]:
print(np.median([1,2,3,4,5,2,2,2,6,1])) # [1,1,2,2,2,2,3,4,5,6]
print(np.mean([1,2,3,4,5,2,2,2,6,1]))

2.0
2.8

In [18]:
# alternativ:'median' = pandas Methoden

#df_tips.groupby('day').agg({'tip': ['mean', np.median], 'day': np.size})
df_tips.groupby('day', observed=False).agg({'tip': ['mean', 'median', 'max', 'min'], 'day': np.size})

           tip                      day
          mean median    max   min size
day
Thur  2.771452  2.305   6.70  1.25   62
Fri   2.734737  3.000   4.73  1.00   19
Sat   2.993103  2.750  10.00  1.00   87
Sun   3.255132  3.150   6.50  1.01   76

In [21]:
# Pandas: Gruppieren nach 2 Kriterien 

df_tips_gruppiert = df_tips.groupby(['smoker', 'day'], observed=False).agg({'tip': ['size', 'mean']})
df_tips_gruppiert = df_tips.groupby([ 'time', 'day','smoker'], observed=False).agg({'tip': ['size', 'mean']})
df_tips_gruppiert

                    tip
                   size      mean
time   day  smoker
Lunch  Thur Yes      17  3.030000
            No       44  2.666364
       Fri  Yes       6  2.280000
            No        1  3.000000
       Sat  Yes       0       NaN
            No        0       NaN
       Sun  Yes       0       NaN
            No        0       NaN
Dinner Thur Yes       0       NaN
            No        1  3.000000
       Fri  Yes       9  3.003333
            No        3  2.750000
       Sat  Yes      42  2.875476
            No       45  3.102889
       Sun  Yes      19  3.516842
            No       57  3.167895

In [28]:
# wie komme ich an smoker?

#df_tips_gruppiert.loc[:,'smoker']
df_tips_gruppiert.loc[:,'tip'].loc[:,'size']

# spalte exisitert nicht?

time    day   smoker
Lunch   Thur  Yes       17
              No        44
        Fri   Yes        6
              No         1
        Sat   Yes        0
              No         0
        Sun   Yes        0
              No         0
Dinner  Thur  Yes        0
              No         1
        Fri   Yes        9
              No         3
        Sat   Yes       42
              No        45
        Sun   Yes       19
              No        57
Name: size, dtype: int64

In [29]:
df_tips_gruppiert.columns

MultiIndex([('tip', 'size'),
            ('tip', 'mean')],
           )

In [30]:
# also smoker und day sind ein index --> gibt unterschiedliche Wege damit umzugehen

# eine Möglichkeit --> as_index=False setzen

df_tips_gruppiert2 = df_tips.groupby(['smoker', 'day'], observed=False, as_index=False).agg({'tip': ['size', 'mean']})
df_tips_gruppiert2

  smoker   day  tip
               size      mean
0    Yes  Thur   17  3.030000
1    Yes   Fri   15  2.714000
2    Yes   Sat   42  2.875476
3    Yes   Sun   19  3.516842
4     No  Thur   45  2.673778
5     No   Fri    4  2.812500
6     No   Sat   45  3.102889
7     No   Sun   57  3.167895

In [ ]:
#df_tips_gruppiert2.columns
#df_tips_gruppiert2.loc[:,'smoker']
df_tips_gruppiert2.loc[:,('tip', 'size')]  # Zugriff über Multiindex
df_tips_gruppiert2.loc[:,[('tip', 'size'),('tip', 'mean')]]  # Zugriff über Multiindex

   tip
  size      mean
0   17  3.030000
1   15  2.714000
2   42  2.875476
3   19  3.516842
4   45  2.673778
5    4  2.812500
6   45  3.102889
7   57  3.167895

In [36]:
# wie heißen meine spalten?

df_tips_gruppiert2.columns

MultiIndex([('smoker',     ''),
            (   'day',     ''),
            (   'tip', 'size'),
            (   'tip', 'mean')],
           )

Weitere Möglichkeit: reset_index(inplace=True) --> unnötige spalten löschen

Zu beachten: Wenn columns den gleichen Namen haben --> work around: erst gruppieren, dann rename() dann reset_index()

etc....

In [ ]:
print(df_tips.reset_index())
#print(df_tips)
#print(df_tips_gruppiert2.reset_index())

None

<h2><font color='lightblue'>Unterschied zu Pivot_table()</font></h2>

In [52]:
df_gruppiert = df_tips.groupby(['sex','day'], observed=False, as_index=False).size()
print(df_gruppiert)
df_gruppiert.pivot(index='sex',columns='day',values='size')

      sex   day  size
0    Male  Thur    30
1    Male   Fri    10
2    Male   Sat    59
3    Male   Sun    58
4  Female  Thur    32
5  Female   Fri     9
6  Female   Sat    28
7  Female   Sun    18

day     Thur  Fri  Sat  Sun
sex
Male      30   10   59   58
Female    32    9   28   18

In [53]:
# beispiel datensatz

df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",

                         "bar", "bar", "bar", "bar"],

                   "B": ["one", "one", "one", "two", "two",

                         "one", "one", "two", "two"],

                   "C": ["small", "large", "large", "small",

                         "small", "large", "small", "small",

                         "large"],

                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],

                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})

df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.pivot_table.html#pandas.DataFrame.pivot_table

In [55]:
a = np.array([[0, 1, 7, 0],
              [3, 0, 2, 19]])
print(a)
print(a.size)
np.count_nonzero(a)

[[ 0  1  7  0]
 [ 3  0  2 19]]
8

5

In [65]:
#table = pd.pivot_table(df, values='D', index=['A', 'B'],columns=['C'], aggfunc=[np.sum, np.mean, np.count_nonzero])
table = df.pivot_table(values='D', index=['A', 'B'],columns=['C'], aggfunc=[np.sum, np.mean, np.count_nonzero])
#table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'B'],columns=['C'], aggfunc=np.sum)

table 
# https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.pivot_table.html#pandas.DataFrame.pivot_table

/var/folders/lz/j9t8k5gx25nbh7ljn1_ld1yr0000gn/T/ipykernel_31330/537150073.py:2: FutureWarning: The provided callable <function sum at 0x1170a6520> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  table = df.pivot_table(values='D', index=['A', 'B'],columns=['C'], aggfunc=[np.sum, np.mean, np.count_nonzero])
/var/folders/lz/j9t8k5gx25nbh7ljn1_ld1yr0000gn/T/ipykernel_31330/537150073.py:2: FutureWarning: The provided callable <function mean at 0x1170a7920> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  table = df.pivot_table(values='D', index=['A', 'B'],columns=['C'], aggfunc=[np.sum, np.mean, np.count_nonzero])

          sum        mean       count_nonzero
C       large small large small         large small
A   B
bar one   4.0   5.0   4.0   5.0           1.0   1.0
    two   7.0   6.0   7.0   6.0           1.0   1.0
foo one   4.0   1.0   2.0   1.0           2.0   1.0
    two   NaN   6.0   NaN   3.0           NaN   2.0

In [66]:
table.columns

MultiIndex([(          'sum', 'large'),
            (          'sum', 'small'),
            (         'mean', 'large'),
            (         'mean', 'small'),
            ('count_nonzero', 'large'),
            ('count_nonzero', 'small')],
           names=[None, 'C'])

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html#pandas.DataFrame.groupby

In [75]:
# nachbauen mit groupby und aggregate

table_groupby = df.groupby(['A','B','C']).agg({'D':['sum', 'mean'],'E':['mean']})#.reset_index()
table_groupby

                D         E
              sum mean mean
A   B   C
bar one large   4  4.0  6.0
        small   5  5.0  8.0
    two large   7  7.0  9.0
        small   6  6.0  9.0
foo one large   4  2.0  4.5
        small   1  1.0  2.0
    two small   6  3.0  5.5

In [76]:
table_groupby.columns

MultiIndex([('D',  'sum'),
            ('D', 'mean'),
            ('E', 'mean')],
           )

In [77]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [80]:
df_titanic = sns.load_dataset('titanic')
df_titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [93]:
#df.head() # default 5
# df.tail() # default 5
#df.info()
# df.describe()
df1 = df.drop("C", axis=1 , inplace=False) # Delete Column
print(df1)
print(df)

     A    B  E
0  foo  one  2
1  foo  one  4
2  foo  one  5
3  foo  two  5
4  foo  two  6
5  bar  one  6
6  bar  one  8
7  bar  two  9
8  bar  two  9
     A    B      C  E
0  foo  one  small  2
1  foo  one  large  4
2  foo  one  large  5
3  foo  two  small  5
4  foo  two  small  6
5  bar  one  large  6
6  bar  one  small  8
7  bar  two  small  9
8  bar  two  large  9

Speichern wir unsere DataFrame als CSV datei oder Excel

In [ ]:
df.to_csv("my_dataFrame.csv",index=False)
df1.to_excel("my_dataFrame.xlsx", index=False)